/* %@ is not a valid regular expression */
"%@ is not a valid regular expression" = "%@ ei ole oikea säännöllinen lauseke";

/* All documents */
"All documents" = "Kaikki asiakirjat";

/* Command Result - Smultron */
"Command Result - Smultron" = "Komennon tulokset - Smultron";

/* Current document */
"Current document" = "Nykyinen asiakirja";

/* Current project */
"Current project" = "Nykyinen projekti";

/* Filter */
"Filter" = "Suodata";

/* Go to the web site (http://smultron.sourceforge.net) to download another version for an earlier Mac OS X system */
"Go to the web site (http://smultron.sourceforge.net) to download another version for an earlier Mac OS X system" = "Mene osoitteeseen (http://smultron.sourceforge.net) ladataksesi version aiemmille Mac OS X -järjestelmille";

/* Hide Size Slider */
"Hide Size Slider" = "Piilota sivu-liukusäädin";

/* It seems as if the file is unwritable or that you do not have permission to save the file %@ */
"It seems as if the file is unwritable or that you do not have permission to save the file %@" = "Tiedosto saattaa olla kirjoitussuojattu tai sinulla ei ole oikeuksia tallentaa tiedostoa %@";

/* New Collection */
"New Collection" = "Uusi kokoelma";

/* New Command */
"New Command" = "Uusi komento";

/* New Snippet */
"New Snippet" = "Uusi pätkä";

/* Old Commands */
"Old Commands" = "Vanhat komennot";

/* Please check if the file is locked, on a media that is unwritable or if you can save it in another location */
"Please check if the file is locked, on a media that is unwritable or if you can save it in another location" = "Tarkista onko tiedosto lukittu, medialla, jolle ei voida kirjoittaa tai jos voit tallentaa sen toiseen sijaintiin";

/* Please consider exporting the commands first. There is no undo available */
"Please consider exporting the commands first. There is no undo available" = "Harkitse komentojen viemistä ensin. Peruminen ei ole mahdollista";

/* Preferences - Smultron */
"Preferences - Smultron" = "Asetukset - Smultron";

/* Run */
"Run" = "Aja";

/* Show Size Slider */
"Show Size Slider" = "Näytä sivu-liukusäädin";

/* Split Window Vertically */
"Split Window Vertically" = "Jaa ikkuna pystysuunnassa";

/* This will delete all items in the collection %@. Are you sure you want to continue? */
"This will delete all items in the collection %@. Are you sure you want to continue?" = "Tämä poistaa kaikki kohteet kokoelmassa %@. Oletko varma että haluat jatkaa?";

/* You need %@ or later to run this version of Smultron */
"You need %@ or later to run this version of Smultron" = "Tarvitset %@ tai myöhemmän käyttääksesi tätä versiota Smultron:sta";

/* Subtitle of alert panel informing user that the file's string encoding needs to be changed */
"Please choose another encoding (such as UTF-8)." = "Valitse toinen koodaus (kuten UTF-8).";

/* Title of alert panel informing user that the file's string encoding needs to be changed. */
"This document can no longer be saved using its original %@ encoding." = "Dokumenttia ei voi enää tallentaa alkuperäistä koodausta (%@) käyttämällä.";
